{
  "architectures": [
    "CamembertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 5,
  "eos_token_id": 6,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "ADJ",
    "2": "ADJWH",
    "3": "ADV",
    "4": "ADVWH",
    "5": "CC",
    "6": "CLO",
    "7": "CLR",
    "8": "CLS",
    "9": "CS",
    "10": "DET",
    "11": "DETWH",
    "12": "ET",
    "13": "I",
    "14": "NC",
    "15": "NPP",
    "16": "P",
    "17": "P+D",
    "18": "PONCT",
    "19": "PREF",
    "20": "PRO",
    "21": "PROREL",
    "22": "PROWH",
    "23": "U",
    "24": "V",
    "25": "VIMP",
    "26": "VINF",
    "27": "VPP",
    "28": "VPR",
    "29": "VS"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ADJ": 1,
    "ADJWH": 2,
    "ADV": 3,
    "ADVWH": 4,
    "CC": 5,
    "CLO": 6,
    "CLR": 7,
    "CLS": 8,
    "CS": 9,
    "DET": 10,
    "DETWH": 11,
    "ET": 12,
    "I": 13,
    "NC": 14,
    "NPP": 15,
    "O": 0,
    "P": 16,
    "P+D": 17,
    "PONCT": 18,
    "PREF": 19,
    "PRO": 20,
    "PROREL": 21,
    "PROWH": 22,
    "U": 23,
    "V": 24,
    "VIMP": 25,
    "VINF": 26,
    "VPP": 27,
    "VPR": 28,
    "VS": 29
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "camembert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "type_vocab_size": 1,
  "vocab_size": 32005
}
